levizh/rt-thread/bsp/hc32/libraries/hc32f4a2_ddl/drivers/hc32_ll_driver/src/hc32f4a2_ll_interrupts_share.c
    /* USB HS EP1 in */

    /* USB HS global */

    /* USB HS wakeup */

    if (1UL == bCM_USART1->CR1_b.RIE) {
        /* USART Ch.1 Rx ORE/FE/PE error */
        u32Tmp1 = CM_USART1->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL137 & BIT_MASK_12))) {
            USART1_RxError_IrqHandler();
        }
        /* USART Ch.1 Rx end */
        if ((1UL == bCM_USART1->SR_b.RXNE) && (0UL != (VSSEL137 & BIT_MASK_13))) {
            USART1_RxFull_IrqHandler();
        }
    }
    /* USART Ch.1 Tx buffer empty */
    if (1UL == bCM_USART1->CR1_b.TXEIE) {
        if ((1UL == bCM_USART1->SR_b.TXE) && (0UL != (VSSEL137 & BIT_MASK_14))) {
            USART1_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.1 Tx end */
    if (1UL == bCM_USART1->CR1_b.TCIE) {
        if ((1UL == bCM_USART1->SR_b.TC) && (0UL != (VSSEL137 & BIT_MASK_15))) {
            USART1_TxComplete_IrqHandler();
        }
    }
    /* USART Ch.1 Tx timeout */
    if (1UL == bCM_USART1->CR1_b.RTOIE) {
        if ((1UL == bCM_USART1->SR_b.RTOF) && (0UL != (VSSEL137 & BIT_MASK_16))) {
            USART1_RxTO_IrqHandler();
        }
    }
    if (1UL == bCM_USART2->CR1_b.RIE) {
        /* USART Ch.2 Rx ORE/FE/PE error */
        u32Tmp1 = CM_USART2->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL137 & BIT_MASK_17))) {
            USART2_RxError_IrqHandler();
        }
        /* USART Ch.2 Rx end */
        if ((1UL == bCM_USART2->SR_b.RXNE) && (0UL != (VSSEL137 & BIT_MASK_18))) {
            USART2_RxFull_IrqHandler();
        }
    }
    /* USART Ch.2 Tx buffer empty */
    if (1UL == bCM_USART2->CR1_b.TXEIE) {
        if ((1UL == bCM_USART2->SR_b.TXE) && (0UL != (VSSEL137 & BIT_MASK_19))) {
            USART2_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.2 Tx end */
    if (1UL == bCM_USART2->CR1_b.TCIE) {
        if ((1UL == bCM_USART2->SR_b.TC) && (0UL != (VSSEL137 & BIT_MASK_20))) {
            USART2_TxComplete_IrqHandler();
        }
    }
    /* USART Ch.2 Tx timeout */
    if (1UL == bCM_USART2->CR1_b.RTOIE) {
        if ((1UL == bCM_USART2->SR_b.RTOF) && (0UL != (VSSEL137 & BIT_MASK_21))) {
            USART2_RxTO_IrqHandler();
        }
    }
    /* SPI Ch.1 Rx end */
    if (1UL == bCM_SPI1->CR1_b.RXIE) {
        if ((1UL == bCM_SPI1->SR_b.RDFF) && (0UL != (VSSEL137 & BIT_MASK_22))) {
            SPI1_RxFull_IrqHandler();
        }
    }
    /* SPI Ch.1 Tx buffer empty */
    if (1UL == bCM_SPI1->CR1_b.TXIE) {
        if ((1UL == bCM_SPI1->SR_b.TDEF) && (0UL != (VSSEL137 & BIT_MASK_23))) {
            SPI1_TxEmpty_IrqHandler();
        }
    }
    /* SPI Ch.1 Bus idle */
    if (1UL == bCM_SPI1->CR1_b.IDIE) {
        if ((0UL == bCM_SPI1->SR_b.IDLNF) && (0UL != (VSSEL137 & BIT_MASK_24))) {
            SPI1_Idle_IrqHandler();
        }
    }
    /* SPI Ch.1 parity/overflow/underflow/mode error */
    if (1UL == bCM_SPI1->CR1_b.EIE) {
        u32Tmp1 = CM_SPI1->SR & (SPI_SR_OVRERF | SPI_SR_MODFERF | SPI_SR_PERF | SPI_SR_UDRERF);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL137 & BIT_MASK_25))) {
            SPI1_Error_IrqHandler();
        }
    }
    /* SPI Ch.2 Rx end */
    if (1UL == bCM_SPI2->CR1_b.RXIE) {
        if ((1UL == bCM_SPI2->SR_b.RDFF) && (0UL != (VSSEL137 & BIT_MASK_27))) {
            SPI2_RxFull_IrqHandler();
        }
    }
    /* SPI Ch.2 Tx buffer empty */
    if (1UL == bCM_SPI2->CR1_b.TXIE) {
        if ((1UL == bCM_SPI2->SR_b.TDEF) && (0UL != (VSSEL137 & BIT_MASK_28))) {
            SPI2_TxEmpty_IrqHandler();
        }
    }
    /* SPI Ch.2 Bus idle */
    if (1UL == bCM_SPI2->CR1_b.IDIE) {
        if ((0UL == bCM_SPI2->SR_b.IDLNF) && (0UL != (VSSEL137 & BIT_MASK_29))) {
            SPI2_Idle_IrqHandler();
        }
    }
    /* SPI Ch.2 parity/overflow/underflow/mode error */
    if (1UL == bCM_SPI2->CR1_b.EIE) {
        u32Tmp1 = CM_SPI2->SR & (SPI_SR_OVRERF | SPI_SR_MODFERF | SPI_SR_PERF | SPI_SR_UDRERF);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL137 & BIT_MASK_30))) {
            SPI2_Error_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.138 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ138_Handler(void)
{
    const uint32_t VSSEL138 = CM_INTC->VSSEL138;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;
    uint8_t RTIF;
    uint8_t RTIE;
    uint8_t ERRINT;
    uint8_t TTCFG;

    /* TimerA Ch.5 overflow */
    if (1UL == bCM_TMRA_5->BCSTR_b.ITENOVF) {
        if ((1UL == bCM_TMRA_5->BCSTR_b.OVFF) && (0UL != (VSSEL138 & BIT_MASK_00))) {
            TMRA_5_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.5 underflow */
    if (1UL == bCM_TMRA_5->BCSTR_b.ITENUDF) {
        if ((1UL == bCM_TMRA_5->BCSTR_b.UDFF) && (0UL != (VSSEL138 & BIT_MASK_01))) {
            TMRA_5_Udf_IrqHandler();
        }
    }
    u32Tmp1 = CM_TMRA_5->ICONR;
    u32Tmp2 = CM_TMRA_5->STFLR;
    /* TimerA Ch.5 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0FUL)) && (0UL != (VSSEL138 & BIT_MASK_02))) {
        TMRA_5_Cmp_IrqHandler();
    }
    /* TimerA Ch.6 overflow */
    if (1UL == bCM_TMRA_6->BCSTR_b.ITENOVF) {
        if ((1UL == bCM_TMRA_6->BCSTR_b.OVFF) && (0UL != (VSSEL138 & BIT_MASK_03))) {
            TMRA_6_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.6 underflow */
    if (1UL == bCM_TMRA_6->BCSTR_b.ITENUDF) {
        if ((1UL == bCM_TMRA_6->BCSTR_b.UDFF) && (0UL != (VSSEL138 & BIT_MASK_04))) {
            TMRA_6_Udf_IrqHandler();
        }
    }
    u32Tmp1 = CM_TMRA_6->ICONR;
    u32Tmp2 = CM_TMRA_6->STFLR;
    /* TimerA Ch.6 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0FUL)) && (0UL != (VSSEL138 & BIT_MASK_05))) {
        TMRA_6_Cmp_IrqHandler();
    }
    /* TimerA Ch.7 overflow */
    if (1UL == bCM_TMRA_7->BCSTR_b.ITENOVF) {
        if ((1UL == bCM_TMRA_7->BCSTR_b.OVFF) && (0UL != (VSSEL138 & BIT_MASK_06))) {
            TMRA_7_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.7 underflow */
    if (1UL == bCM_TMRA_7->BCSTR_b.ITENUDF) {
        if ((1UL == bCM_TMRA_7->BCSTR_b.UDFF) && (0UL != (VSSEL138 & BIT_MASK_07))) {
            TMRA_7_Udf_IrqHandler();
        }
    }
    u32Tmp1 = CM_TMRA_7->ICONR;
    u32Tmp2 = CM_TMRA_7->STFLR;
    /* TimerA Ch.7 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0FUL)) && (0UL != (VSSEL138 & BIT_MASK_08))) {
        TMRA_7_Cmp_IrqHandler();
    }
    /* TimerA Ch.8 overflow */
    if (1UL == bCM_TMRA_8->BCSTR_b.ITENOVF) {
        if ((1UL == bCM_TMRA_8->BCSTR_b.OVFF) && (0UL != (VSSEL138 & BIT_MASK_09))) {
            TMRA_8_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.8 underflow */
    if (1UL == bCM_TMRA_8->BCSTR_b.ITENUDF) {
        if ((1UL == bCM_TMRA_8->BCSTR_b.UDFF) && (0UL != (VSSEL138 & BIT_MASK_10))) {
            TMRA_8_Udf_IrqHandler();
        }
    }
    u32Tmp1 = CM_TMRA_8->ICONR;
    u32Tmp2 = CM_TMRA_8->STFLR;
    /* TimerA Ch.8 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0FUL)) && (0UL != (VSSEL138 & BIT_MASK_11))) {
        TMRA_8_Cmp_IrqHandler();
    }
    if (1UL == bCM_USART3->CR1_b.RIE) {
        /* USART Ch.3 Rx ORE/FE/PE error */
        u32Tmp1 = CM_USART3->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL138 & BIT_MASK_12))) {
            USART3_RxError_IrqHandler();
        }
        /* USART Ch.3 Rx end */
        if ((1UL == bCM_USART3->SR_b.RXNE) && (0UL != (VSSEL138 & BIT_MASK_13))) {
            USART3_RxFull_IrqHandler();
        }
    }
    /* USART Ch.3 Tx buffer empty */
    if (1UL == bCM_USART3->CR1_b.TXEIE) {
        if ((1UL == bCM_USART3->SR_b.TXE) && (0UL != (VSSEL138 & BIT_MASK_14))) {
            USART3_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.3 Tx end */
    if (1UL == bCM_USART3->CR1_b.TCIE) {
        if ((1UL == bCM_USART3->SR_b.TC) && (0UL != (VSSEL138 & BIT_MASK_15))) {
            USART3_TxComplete_IrqHandler();
        }
    }
    if (1UL == bCM_USART4->CR1_b.RIE) {
        /* USART Ch.4 Rx ORE/FE/PE error */
        u32Tmp1 = CM_USART4->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL138 & BIT_MASK_16))) {
            USART4_RxError_IrqHandler();
        }
        /* USART Ch.4 Rx end */
        if ((1UL == bCM_USART4->SR_b.RXNE) && (0UL != (VSSEL138 & BIT_MASK_17))) {
            USART4_RxFull_IrqHandler();
        }
    }
    /* USART Ch.4 Tx buffer empty */
    if (1UL == bCM_USART4->CR1_b.TXEIE) {
        if ((1UL == bCM_USART4->SR_b.TXE) && (0UL != (VSSEL138 & BIT_MASK_18))) {
            USART4_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.4 Tx end */
    if (1UL == bCM_USART4->CR1_b.TCIE) {
        if ((1UL == bCM_USART4->SR_b.TC) && (0UL != (VSSEL138 & BIT_MASK_19))) {
            USART4_TxComplete_IrqHandler();
        }
    }
    /* CAN Ch.1 */
    if (0UL != (VSSEL138 & BIT_MASK_20)) {
        RTIF = CM_CAN1->RTIF;
        RTIE = CM_CAN1->RTIE;
        ERRINT = CM_CAN1->ERRINT;
        TTCFG = CM_CAN1->TTCFG;
        if ((0U != (TTCFG & CAN_TTCFG_TEIF))            ||                          \
                (0U != (RTIF & CAN_RTIF_AIF))           ||                          \
                (0U != (RTIF & RTIE & 0xFEU))           ||                          \
                ((0U != (ERRINT & CAN_ERRINT_BEIE))     &&                          \
                 (0U != (ERRINT & CAN_ERRINT_BEIF)))    ||                          \
                ((0U != (ERRINT & CAN_ERRINT_ALIE))     &&                          \
                 (0U != (ERRINT & CAN_ERRINT_ALIF)))    ||                          \
                ((0U != (ERRINT & CAN_ERRINT_EPIE))     &&                          \
                 (0U != (ERRINT & CAN_ERRINT_EPIF)))    ||                          \
                ((0U != (TTCFG & CAN_TTCFG_TTIE))       &&                          \
                 (0U != (TTCFG & CAN_TTCFG_TTIF)))      ||                          \
                ((0U != (TTCFG & CAN_TTCFG_WTIE))       &&                          \
                 (0U != (TTCFG & CAN_TTCFG_WTIF)))) {
            CAN1_IrqHandler();
        }
    }
    /* CAN Ch.2 */
    if (0UL != (VSSEL138 & BIT_MASK_21)) {
        RTIF = CM_CAN2->RTIF;
        RTIE = CM_CAN2->RTIE;
        ERRINT = CM_CAN2->ERRINT;
        TTCFG = CM_CAN2->TTCFG;
        if ((0U != (TTCFG & CAN_TTCFG_TEIF))            ||                          \
                (0U != (RTIF & CAN_RTIF_AIF))           ||                          \
                (0U != (RTIF & RTIE & 0xFEU))           ||                          \
                ((0U != (ERRINT & CAN_ERRINT_BEIE))     &&                          \
                 (0U != (ERRINT & CAN_ERRINT_BEIF)))    ||                          \
                ((0U != (ERRINT & CAN_ERRINT_ALIE))     &&                          \
                 (0U != (ERRINT & CAN_ERRINT_ALIF)))    ||                          \
                ((0U != (ERRINT & CAN_ERRINT_EPIE))     &&                          \
                 (0U != (ERRINT & CAN_ERRINT_EPIF)))    ||                          \
                ((0U != (TTCFG & CAN_TTCFG_TTIE))       &&                          \
                 (0U != (TTCFG & CAN_TTCFG_TTIF)))      ||                          \
                ((0U != (TTCFG & CAN_TTCFG_WTIE))       &&                          \
                 (0U != (TTCFG & CAN_TTCFG_WTIF)))) {
            CAN2_IrqHandler();
        }
    }
    /* SPI Ch.3 Rx end */
    if (1UL == bCM_SPI3->CR1_b.RXIE) {
        if ((1UL == bCM_SPI3->SR_b.RDFF) && (0UL != (VSSEL138 & BIT_MASK_22))) {
            SPI3_RxFull_IrqHandler();
        }
    }
    /* SPI Ch.3 Tx buffer empty */
    if (1UL == bCM_SPI3->CR1_b.TXIE) {
        if ((1UL == bCM_SPI3->SR_b.TDEF) && (0UL != (VSSEL138 & BIT_MASK_23))) {
            SPI3_TxEmpty_IrqHandler();
        }
    }
    /* SPI Ch.3 Bus idle */
    if (1UL == bCM_SPI3->CR1_b.IDIE) {
        if ((0UL == bCM_SPI3->SR_b.IDLNF) && (0UL != (VSSEL138 & BIT_MASK_24))) {
            SPI3_Idle_IrqHandler();
        }
    }
    /* SPI Ch.3 parity/overflow/underflow/mode error */
    if (1UL == bCM_SPI3->CR1_b.EIE) {
        u32Tmp1 = CM_SPI3->SR & (SPI_SR_OVRERF | SPI_SR_MODFERF | SPI_SR_PERF | SPI_SR_UDRERF);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL138 & BIT_MASK_25))) {
            SPI3_Error_IrqHandler();
        }
    }
    /* SPI Ch.4 Rx end */
    if (1UL == bCM_SPI4->CR1_b.RXIE) {
        if ((1UL == bCM_SPI4->SR_b.RDFF) && (0UL != (VSSEL138 & BIT_MASK_27))) {
            SPI4_RxFull_IrqHandler();
        }
    }
    /* SPI Ch.4 Tx buffer empty */
    if (1UL == bCM_SPI4->CR1_b.TXIE) {
        if ((1UL == bCM_SPI4->SR_b.TDEF) && (0UL != (VSSEL138 & BIT_MASK_28))) {
            SPI4_TxEmpty_IrqHandler();
        }
    }
    /* SPI Ch.4 Bus idle */
    if (1UL == bCM_SPI4->CR1_b.IDIE) {
        if ((0UL == bCM_SPI4->SR_b.IDLNF) && (0UL != (VSSEL138 & BIT_MASK_29))) {
            SPI4_Idle_IrqHandler();
        }
    }
    /* SPI Ch.4 parity/overflow/underflow/mode error */
    if (1UL == bCM_SPI4->CR1_b.EIE) {
        u32Tmp1 = CM_SPI4->SR & (SPI_SR_OVRERF | SPI_SR_MODFERF | SPI_SR_PERF | SPI_SR_UDRERF);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL138 & BIT_MASK_30))) {
            SPI4_Error_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.139 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ139_Handler(void)
{
    const uint32_t VSSEL139 = CM_INTC->VSSEL139;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;

