levizh/rt-thread/bsp/hc32/libraries/hc32f4a2_ddl/drivers/hc32_ll_driver/src/hc32f4a2_ll_interrupts_share.c
    /* TimerA Ch.9 overflow */
    if (1UL == bCM_TMRA_9->BCSTR_b.ITENOVF) {
        if ((1UL == bCM_TMRA_9->BCSTR_b.OVFF) && (0UL != (VSSEL139 & BIT_MASK_00))) {
            TMRA_9_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.9 underflow */
    if (1UL == bCM_TMRA_9->BCSTR_b.ITENUDF) {
        if ((1UL == bCM_TMRA_9->BCSTR_b.UDFF) && (0UL != (VSSEL139 & BIT_MASK_01))) {
            TMRA_9_Udf_IrqHandler();
        }
    }
    u32Tmp1 = CM_TMRA_9->ICONR;
    u32Tmp2 = CM_TMRA_9->STFLR;
    /* TimerA Ch.9 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0FUL)) && (0UL != (VSSEL139 & BIT_MASK_02))) {
        TMRA_9_Cmp_IrqHandler();
    }
    /* TimerA Ch.10 overflow */
    if (1UL == bCM_TMRA_10->BCSTR_b.ITENOVF) {
        if ((1UL == bCM_TMRA_10->BCSTR_b.OVFF) && (0UL != (VSSEL139 & BIT_MASK_03))) {
            TMRA_10_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.10 underflow */
    if (1UL == bCM_TMRA_10->BCSTR_b.ITENUDF) {
        if ((1UL == bCM_TMRA_10->BCSTR_b.UDFF) && (0UL != (VSSEL139 & BIT_MASK_04))) {
            TMRA_10_Udf_IrqHandler();
        }
    }
    u32Tmp1 = CM_TMRA_10->ICONR;
    u32Tmp2 = CM_TMRA_10->STFLR;
    /* TimerA Ch.10 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0FUL)) && (0UL != (VSSEL139 & BIT_MASK_05))) {
        TMRA_10_Cmp_IrqHandler();
    }
    /* TimerA Ch.11 overflow */
    if (1UL == bCM_TMRA_11->BCSTR_b.ITENOVF) {
        if ((1UL == bCM_TMRA_11->BCSTR_b.OVFF) && (0UL != (VSSEL139 & BIT_MASK_06))) {
            TMRA_11_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.11 underflow */
    if (1UL == bCM_TMRA_11->BCSTR_b.ITENUDF) {
        if ((1UL == bCM_TMRA_11->BCSTR_b.UDFF) && (0UL != (VSSEL139 & BIT_MASK_07))) {
            TMRA_11_Udf_IrqHandler();
        }
    }
    u32Tmp1 = CM_TMRA_11->ICONR;
    u32Tmp2 = CM_TMRA_11->STFLR;
    /* TimerA Ch.11 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0FUL)) && (0UL != (VSSEL139 & BIT_MASK_08))) {
        TMRA_11_Cmp_IrqHandler();
    }
    /* TimerA Ch.12 overflow */
    if (1UL == bCM_TMRA_12->BCSTR_b.ITENOVF) {
        if ((1UL == bCM_TMRA_12->BCSTR_b.OVFF) && (0UL != (VSSEL139 & BIT_MASK_09))) {
            TMRA_12_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.12 underflow */
    if (1UL == bCM_TMRA_12->BCSTR_b.ITENUDF) {
        if ((1UL == bCM_TMRA_12->BCSTR_b.UDFF) && (0UL != (VSSEL139 & BIT_MASK_10))) {
            TMRA_12_Udf_IrqHandler();
        }
    }
    u32Tmp1 = CM_TMRA_12->ICONR;
    u32Tmp2 = CM_TMRA_12->STFLR;
    /* TimerA Ch.12 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0FUL)) && (0UL != (VSSEL139 & BIT_MASK_11))) {
        TMRA_12_Cmp_IrqHandler();
    }
    /* USART Ch.5 LIN bus break */
    if (1UL == bCM_USART5->CR2_b.LBDIE) {
        if ((1UL == bCM_USART5->SR_b.LBD) && (0UL != (VSSEL139 & BIT_MASK_12))) {
            USART5_LinBreakField_IrqHandler();
        }
    }
    /* USART Ch.5 LIN bus wakeup */
    if (1UL == bCM_USART5->CR2_b.WKUPE) {
        if ((1UL == bCM_USART5->SR_b.WKUP) && (0UL != (VSSEL139 & BIT_MASK_12))) {
            USART5_LinWakeup_IrqHandler();
        }
    }
    if (1UL == bCM_USART5->CR1_b.RIE) {
        /* USART Ch.5 Rx ORE/FE/PE error */
        u32Tmp1 = CM_USART5->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL139 & BIT_MASK_13))) {
            USART5_RxError_IrqHandler();
        }
        /* USART Ch.5 Rx end */
        if ((1UL == bCM_USART5->SR_b.RXNE) && (0UL != (VSSEL139 & BIT_MASK_14))) {
            USART5_RxFull_IrqHandler();
        }
    }
    /* USART Ch.5 Tx buffer empty */
    if (1UL == bCM_USART5->CR1_b.TXEIE) {
        if ((1UL == bCM_USART5->SR_b.TXE) && (0UL != (VSSEL139 & BIT_MASK_15))) {
            USART5_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.5 Tx end */
    if (1UL == bCM_USART5->CR1_b.TCIE) {
        if ((1UL == bCM_USART5->SR_b.TC) && (0UL != (VSSEL139 & BIT_MASK_16))) {
            USART5_TxComplete_IrqHandler();
        }
    }
    if (1UL == bCM_USART6->CR1_b.RIE) {
        /* USART Ch.6 Rx ORE/FE/PE error */
        u32Tmp1 = CM_USART6->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL139 & BIT_MASK_17))) {
            USART6_RxError_IrqHandler();
        }
        /* USART Ch.6 Rx end */
        if ((1UL == bCM_USART6->SR_b.RXNE) && (0UL != (VSSEL139 & BIT_MASK_18))) {
            USART6_RxFull_IrqHandler();
        }
    }
    /* USART Ch.6 Tx buffer empty */
    if (1UL == bCM_USART6->CR1_b.TXEIE) {
        if ((1UL == bCM_USART6->SR_b.TXE) && (0UL != (VSSEL139 & BIT_MASK_19))) {
            USART6_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.6 Tx end */
    if (1UL == bCM_USART6->CR1_b.TCIE) {
        if ((1UL == bCM_USART6->SR_b.TC) && (0UL != (VSSEL139 & BIT_MASK_20))) {
            USART6_TxComplete_IrqHandler();
        }
    }
    /* USART Ch.6 Tx timeout */
    if (1UL == bCM_USART6->CR1_b.RTOIE) {
        if ((1UL == bCM_USART6->SR_b.RTOF) && (0UL != (VSSEL139 & BIT_MASK_21))) {
            USART6_RxTO_IrqHandler();
        }
    }
    /* SPI Ch.5 Rx end */
    if (1UL == bCM_SPI5->CR1_b.RXIE) {
        if ((1UL == bCM_SPI5->SR_b.RDFF) && (0UL != (VSSEL139 & BIT_MASK_22))) {
            SPI5_RxFull_IrqHandler();
        }
    }
    /* SPI Ch.5 Tx buffer empty */
    if (1UL == bCM_SPI5->CR1_b.TXIE) {
        if ((1UL == bCM_SPI5->SR_b.TDEF) && (0UL != (VSSEL139 & BIT_MASK_23))) {
            SPI5_TxEmpty_IrqHandler();
        }
    }
    /* SPI Ch.5 Bus idle */
    if (1UL == bCM_SPI5->CR1_b.IDIE) {
        if ((0UL == bCM_SPI5->SR_b.IDLNF) && (0UL != (VSSEL139 & BIT_MASK_24))) {
            SPI5_Idle_IrqHandler();
        }
    }
    /* SPI Ch.5 parity/overflow/underflow/mode error */
    if (1UL == bCM_SPI5->CR1_b.EIE) {
        u32Tmp1 = CM_SPI5->SR & (SPI_SR_OVRERF | SPI_SR_MODFERF | SPI_SR_PERF | SPI_SR_UDRERF);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL139 & BIT_MASK_25))) {
            SPI5_Error_IrqHandler();
        }
    }
    /* SPI Ch.6 Rx end */
    if (1UL == bCM_SPI6->CR1_b.RXIE) {
        if ((1UL == bCM_SPI6->SR_b.RDFF) && (0UL != (VSSEL139 & BIT_MASK_27))) {
            SPI6_RxFull_IrqHandler();
        }
    }
    /* SPI Ch.6 Tx buffer empty */
    if (1UL == bCM_SPI6->CR1_b.TXIE) {
        if ((1UL == bCM_SPI6->SR_b.TDEF) && (0UL != (VSSEL139 & BIT_MASK_28))) {
            SPI6_TxEmpty_IrqHandler();
        }
    }
    /* SPI Ch.6 Bus idle */
    if (1UL == bCM_SPI6->CR1_b.IDIE) {
        if ((0UL == bCM_SPI6->SR_b.IDLNF) && (0UL != (VSSEL139 & BIT_MASK_29))) {
            SPI6_Idle_IrqHandler();
        }
    }
    /* SPI Ch.6 parity/overflow/underflow/mode error */
    if (1UL == bCM_SPI6->CR1_b.EIE) {
        u32Tmp1 = CM_SPI6->SR & (SPI_SR_OVRERF | SPI_SR_MODFERF | SPI_SR_PERF | SPI_SR_UDRERF);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL139 & BIT_MASK_30))) {
            SPI6_Error_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.140 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ140_Handler(void)
{
    const uint32_t VSSEL140 = CM_INTC->VSSEL140;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;
    uint16_t NORINTST;
    uint16_t NORINTSGEN;
    uint16_t ERRINTSGEN;
    uint32_t MMC_REVSTSR;
    uint32_t MMC_TRSSTSR;
    uint32_t MMC_RITCTLR;
    uint32_t MMC_TITCTLR;
    uint32_t DMA_DMASTSR;
    uint32_t DMA_INTENAR;
    uint32_t PTP_INTE;
    uint32_t PMT_INTMASK;
    uint32_t PMT_INTSTSR;
    uint32_t PTP_INTMASK;
    uint32_t PTP_INTSTSR;

    /* I2S Ch.1 Tx */
    if (1UL == bCM_I2S1->CTRL_b.TXIE) {
        if ((1UL == bCM_I2S1->SR_b.TXBA) && (0UL != (VSSEL140 & BIT_MASK_00))) {
            I2S1_Tx_IrqHandler();
        }
    }
    /* I2S Ch.1 Rx */
    if (1UL == bCM_I2S1->CTRL_b.RXIE) {
        if ((1UL == bCM_I2S1->SR_b.RXBA) && (0UL != (VSSEL140 & BIT_MASK_01))) {
            I2S1_Rx_IrqHandler();
        }
    }
    /* I2S Ch.1 Error */
    if (1UL == bCM_I2S1->CTRL_b.EIE) {
        u32Tmp1 = CM_I2S1->ER & (I2S_ER_TXERR | I2S_ER_RXERR);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL140 & BIT_MASK_02))) {
            I2S1_Error_IrqHandler();
        }
    }
    /* I2S Ch.2 Tx */
    if (1UL == bCM_I2S2->CTRL_b.TXIE) {
        if ((1UL == bCM_I2S2->SR_b.TXBA) && (0UL != (VSSEL140 & BIT_MASK_03))) {
            I2S2_Tx_IrqHandler();
        }
    }
    /* I2S Ch.2 Rx */
    if (1UL == bCM_I2S2->CTRL_b.RXIE) {
        if ((1UL == bCM_I2S2->SR_b.RXBA) && (0UL != (VSSEL140 & BIT_MASK_04))) {
            I2S2_Rx_IrqHandler();
        }
    }
    /* I2S Ch.2 Error */
    if (1UL == bCM_I2S2->CTRL_b.EIE) {
        u32Tmp1 = CM_I2S2->ER & (I2S_ER_TXERR | I2S_ER_RXERR);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL140 & BIT_MASK_05))) {
            I2S2_Error_IrqHandler();
        }
    }
    if (1UL == bCM_USART7->CR1_b.RIE) {
        /* USART Ch.7 Rx ORE/FE/PE error */
        u32Tmp1 = CM_USART7->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL140 & BIT_MASK_06))) {
            USART7_RxError_IrqHandler();
        }
        /* USART Ch.7 Rx end */
        if ((1UL == bCM_USART7->SR_b.RXNE) && (0UL != (VSSEL140 & BIT_MASK_07))) {
            USART7_RxFull_IrqHandler();
        }
    }
    /* USART Ch.7 Tx buffer empty */
    if (1UL == bCM_USART7->CR1_b.TXEIE) {
        if ((1UL == bCM_USART7->SR_b.TXE) && (0UL != (VSSEL140 & BIT_MASK_08))) {
            USART7_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.7 Tx end */
    if (1UL == bCM_USART7->CR1_b.TCIE) {
        if ((1UL == bCM_USART7->SR_b.TC) && (0UL != (VSSEL140 & BIT_MASK_09))) {
            USART7_TxComplete_IrqHandler();
        }
    }
    /* USART Ch.7 Tx timeout */
    if (1UL == bCM_USART7->CR1_b.RTOIE) {
        if ((1UL == bCM_USART7->SR_b.RTOF) && (0UL != (VSSEL140 & BIT_MASK_10))) {
            USART7_RxTO_IrqHandler();
        }
    }
    if (1UL == bCM_USART8->CR1_b.RIE) {
        /* USART Ch.8 Rx ORE/FE/PE error */
        u32Tmp1 = CM_USART8->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL140 & BIT_MASK_11))) {
            USART8_RxError_IrqHandler();
        }
        /* USART Ch.8 Rx end */
        if ((1UL == bCM_USART8->SR_b.RXNE) && (0UL != (VSSEL140 & BIT_MASK_12))) {
            USART8_RxFull_IrqHandler();
        }
    }
    /* USART Ch.8 Tx buffer empty */
    if (1UL == bCM_USART8->CR1_b.TXEIE) {
        if ((1UL == bCM_USART8->SR_b.TXE) && (0UL != (VSSEL140 & BIT_MASK_13))) {
            USART8_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.8 Tx end */
    if (1UL == bCM_USART8->CR1_b.TCIE) {
        if ((1UL == bCM_USART8->SR_b.TC) && (0UL != (VSSEL140 & BIT_MASK_14))) {
            USART8_TxComplete_IrqHandler();
        }
    }
    /* USB FS global interrupt */
    if (1UL == bCM_USBFS->GAHBCFG_b.GINTMSK) {
        u32Tmp1 = CM_USBFS->GINTMSK & 0xF77CFCFBUL;
        u32Tmp2 = CM_USBFS->GINTSTS & 0xF77CFCFBUL;
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL140 & BIT_MASK_15))) {
            USBFS_Global_IrqHandler();
        }
    }
    /* SDIO unit 1 */
    if (0UL != (VSSEL140 & BIT_MASK_20)) {
        NORINTST = CM_SDIOC1->NORINTST & (SDIOC_NORINTST_CINT | SDIOC_NORINTST_CRM | SDIOC_NORINTST_CIST |  \
                                          SDIOC_NORINTST_BRR  | SDIOC_NORINTST_BWR | SDIOC_NORINTST_BGE  |  \
                                          SDIOC_NORINTST_TC   | SDIOC_NORINTST_CC);
        NORINTSGEN = CM_SDIOC1->NORINTSGEN & (SDIOC_NORINTSTEN_CINTEN | SDIOC_NORINTSTEN_CRMEN |    \
                                              SDIOC_NORINTSTEN_CISTEN | SDIOC_NORINTSTEN_BRREN |    \
                                              SDIOC_NORINTSTEN_BWREN  | SDIOC_NORINTSTEN_BGEEN |    \
                                              SDIOC_NORINTSTEN_TCEN   | SDIOC_NORINTSTEN_CCEN);
        ERRINTSGEN = CM_SDIOC1->ERRINTSGEN & (SDIOC_ERRINTSTEN_ACEEN | SDIOC_ERRINTSTEN_DEBEEN |    \
                                              SDIOC_ERRINTSTEN_DCEEN | SDIOC_ERRINTSTEN_DTOEEN |    \
                                              SDIOC_ERRINTSTEN_CIEEN | SDIOC_ERRINTSTEN_CEBEEN |    \
                                              SDIOC_ERRINTSTEN_CCEEN | SDIOC_ERRINTSTEN_CTOEEN);
        if (0U != (NORINTST & NORINTSGEN)) {
            SDIOC1_Normal_IrqHandler();
        }
        if ((1UL == bCM_SDIOC1->NORINTST_b.EI) && (0U != ERRINTSGEN)) {
            SDIOC1_Error_IrqHandler();
        }
    }
    /* SDIO unit 2 */
    if (0UL != (VSSEL140 & BIT_MASK_23)) {
        NORINTST = CM_SDIOC2->NORINTST & (SDIOC_NORINTST_CINT | SDIOC_NORINTST_CRM | SDIOC_NORINTST_CIST |  \
                                          SDIOC_NORINTST_BRR  | SDIOC_NORINTST_BWR | SDIOC_NORINTST_BGE  |  \
                                          SDIOC_NORINTST_TC   | SDIOC_NORINTST_CC);
        NORINTSGEN = CM_SDIOC2->NORINTSGEN & (SDIOC_NORINTSTEN_CINTEN | SDIOC_NORINTSTEN_CRMEN |    \
                                              SDIOC_NORINTSTEN_CISTEN | SDIOC_NORINTSTEN_BRREN |    \
                                              SDIOC_NORINTSTEN_BWREN  | SDIOC_NORINTSTEN_BGEEN |    \
                                              SDIOC_NORINTSTEN_TCEN   | SDIOC_NORINTSTEN_CCEN);
        ERRINTSGEN = CM_SDIOC2->ERRINTSGEN & (SDIOC_ERRINTSTEN_ACEEN | SDIOC_ERRINTSTEN_DEBEEN |    \
                                              SDIOC_ERRINTSTEN_DCEEN | SDIOC_ERRINTSTEN_DTOEEN |    \
                                              SDIOC_ERRINTSTEN_CIEEN | SDIOC_ERRINTSTEN_CEBEEN |    \
                                              SDIOC_ERRINTSTEN_CCEEN | SDIOC_ERRINTSTEN_CTOEEN);
        if (0U != (NORINTST & NORINTSGEN)) {
            SDIOC2_Normal_IrqHandler();
        }
        if ((1UL == bCM_SDIOC2->NORINTST_b.EI) && (0U != ERRINTSGEN)) {
            SDIOC2_Error_IrqHandler();
        }
    }
    /* Ethernat global */
    MMC_REVSTSR = CM_ETH->MMC_REVSTSR & (ETH_MMC_REVSTSR_RXOEIS | ETH_MMC_REVSTSR_RXLEIS |  \
                                         ETH_MMC_REVSTSR_RXUGIS | ETH_MMC_REVSTSR_RXREIS |  \
                                         ETH_MMC_REVSTSR_RXAEIS | ETH_MMC_REVSTSR_RXCEIS |  \
                                         ETH_MMC_REVSTSR_RXMGIS | ETH_MMC_REVSTSR_RXBGIS);
    MMC_TRSSTSR = CM_ETH->MMC_TRSSTSR & (ETH_MMC_TRSSTSR_TXEDEIS | ETH_MMC_TRSSTSR_TXUGIS |  \
                                         ETH_MMC_TRSSTSR_TXCAEIS | ETH_MMC_TRSSTSR_TXECEIS |  \
                                         ETH_MMC_TRSSTSR_TXLCEIS | ETH_MMC_TRSSTSR_TXDEEIS |  \
                                         ETH_MMC_TRSSTSR_TXMGIS | ETH_MMC_TRSSTSR_TXBGIS);
    MMC_RITCTLR = CM_ETH->MMC_RITCTLR & (ETH_MMC_RITCTLR_RXBGIM | ETH_MMC_RITCTLR_RXMGIM |  \
                                         ETH_MMC_RITCTLR_RXCEIM | ETH_MMC_RITCTLR_RXAEIM |  \
                                         ETH_MMC_RITCTLR_RXREIM | ETH_MMC_RITCTLR_RXUGIM |  \
                                         ETH_MMC_RITCTLR_RXLEIM | ETH_MMC_RITCTLR_RXOEIM);
    MMC_TITCTLR = CM_ETH->MMC_TITCTLR & (ETH_MMC_TITCTLR_TXBGIM | ETH_MMC_TITCTLR_TXMGIM |  \
                                         ETH_MMC_TITCTLR_TXDEEIM | ETH_MMC_TITCTLR_TXLCEIM |  \
                                         ETH_MMC_TITCTLR_TXECEIM | ETH_MMC_TITCTLR_TXCAEIM |  \
                                         ETH_MMC_TITCTLR_TXUGIM | ETH_MMC_TITCTLR_TXEDEIM);
    PMT_INTMASK = bCM_ETH->MAC_INTMSKR_b.PMTIM;
    PMT_INTSTSR  = bCM_ETH->MAC_INTSTSR_b.PMTIS;
    PTP_INTMASK = bCM_ETH->MAC_INTMSKR_b.TSPIM;
    PTP_INTSTSR  = bCM_ETH->MAC_INTSTSR_b.TSPIS;
    PTP_INTE    = bCM_ETH->PTP_TSPCTLR_b.TSPINT;

    DMA_DMASTSR = CM_ETH->DMA_DMASTSR & (ETH_DMA_DMASTSR_AIS | ETH_DMA_DMASTSR_NIS);
    DMA_INTENAR = CM_ETH->DMA_INTENAR & (ETH_DMA_INTENAR_AIE | ETH_DMA_INTENAR_NIE);
    if (0UL != (VSSEL140 & BIT_MASK_28)) {
        if ((0UL != (MMC_REVSTSR & (~MMC_RITCTLR))) ||                          \
                (0UL != (MMC_TRSSTSR & (~MMC_TITCTLR))) ||                          \
                (0UL != (PMT_INTSTSR & (~PMT_INTMASK))) ||                          \
                (0UL != (PTP_INTSTSR & (~PTP_INTMASK) & PTP_INTE)) ||               \
                (0UL != (DMA_DMASTSR & DMA_INTENAR))) {
            ETH_Global_IrqHandler();
        }
    }

    /* Ethernat wakeup */
    if (0UL == bCM_ETH->MAC_INTMSKR_b.PMTIM) {
        if ((1UL == bCM_ETH->MAC_INTSTSR_b.PMTIS) && (0UL != (VSSEL140 & BIT_MASK_29))) {
            ETH_Wakeup_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.141 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ141_Handler(void)
{
    const uint32_t VSSEL141 = CM_INTC->VSSEL141;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;

