levizh/rt-thread/bsp/hc32/libraries/hc32f4a2_ddl/drivers/hc32_ll_driver/src/hc32f4a2_ll_interrupts_share.c
/**
 * @defgroup Share_Interrupts_Weakdef_Prototypes Share Interrupts weak function prototypes
 * @{
 */
__WEAKDEF void EXTINT00_IrqHandler(void)
{
}
__WEAKDEF void EXTINT01_IrqHandler(void)
{
}
__WEAKDEF void EXTINT02_IrqHandler(void)
{
}
__WEAKDEF void EXTINT03_IrqHandler(void)
{
}
__WEAKDEF void EXTINT04_IrqHandler(void)
{
}
__WEAKDEF void EXTINT05_IrqHandler(void)
{
}
__WEAKDEF void EXTINT06_IrqHandler(void)
{
}
__WEAKDEF void EXTINT07_IrqHandler(void)
{
}
__WEAKDEF void EXTINT08_IrqHandler(void)
{
}
__WEAKDEF void EXTINT09_IrqHandler(void)
{
}
__WEAKDEF void EXTINT10_IrqHandler(void)
{
}
__WEAKDEF void EXTINT11_IrqHandler(void)
{
}
__WEAKDEF void EXTINT12_IrqHandler(void)
{
}
__WEAKDEF void EXTINT13_IrqHandler(void)
{
}
__WEAKDEF void EXTINT14_IrqHandler(void)
{
}
__WEAKDEF void EXTINT15_IrqHandler(void)
{
}
__WEAKDEF void DMA1_TC0_IrqHandler(void)
{
}
__WEAKDEF void DMA1_TC1_IrqHandler(void)
{
}
__WEAKDEF void DMA1_TC2_IrqHandler(void)
{
}
__WEAKDEF void DMA1_TC3_IrqHandler(void)
{
}
__WEAKDEF void DMA1_TC4_IrqHandler(void)
{
}
__WEAKDEF void DMA1_TC5_IrqHandler(void)
{
}
__WEAKDEF void DMA1_TC6_IrqHandler(void)
{
}
__WEAKDEF void DMA1_TC7_IrqHandler(void)
{
}
__WEAKDEF void DMA1_BTC0_IrqHandler(void)
{
}
__WEAKDEF void DMA1_BTC1_IrqHandler(void)
{
}
__WEAKDEF void DMA1_BTC2_IrqHandler(void)
{
}
__WEAKDEF void DMA1_BTC3_IrqHandler(void)
{
}
__WEAKDEF void DMA1_BTC4_IrqHandler(void)
{
}
__WEAKDEF void DMA1_BTC5_IrqHandler(void)
{
}
__WEAKDEF void DMA1_BTC6_IrqHandler(void)
{
}
__WEAKDEF void DMA1_BTC7_IrqHandler(void)
{
}
__WEAKDEF void DMA1_Error0_IrqHandler(void)
{
}
__WEAKDEF void DMA1_Error1_IrqHandler(void)
{
}
__WEAKDEF void DMA1_Error2_IrqHandler(void)
{
}
__WEAKDEF void DMA1_Error3_IrqHandler(void)
{
}
__WEAKDEF void DMA1_Error4_IrqHandler(void)
{
}
__WEAKDEF void DMA1_Error5_IrqHandler(void)
{
}
__WEAKDEF void DMA1_Error6_IrqHandler(void)
{
}
__WEAKDEF void DMA1_Error7_IrqHandler(void)
{
}
__WEAKDEF void DMA2_TC0_IrqHandler(void)
{
}
__WEAKDEF void DMA2_TC1_IrqHandler(void)
{
}
__WEAKDEF void DMA2_TC2_IrqHandler(void)
{
}
__WEAKDEF void DMA2_TC3_IrqHandler(void)
{
}
__WEAKDEF void DMA2_TC4_IrqHandler(void)
{
}
__WEAKDEF void DMA2_TC5_IrqHandler(void)
{
}
__WEAKDEF void DMA2_TC6_IrqHandler(void)
{
}
__WEAKDEF void DMA2_TC7_IrqHandler(void)
{
}
__WEAKDEF void DMA2_BTC0_IrqHandler(void)
{
}
__WEAKDEF void DMA2_BTC1_IrqHandler(void)
{
}
__WEAKDEF void DMA2_BTC2_IrqHandler(void)
{
}
__WEAKDEF void DMA2_BTC3_IrqHandler(void)
{
}
__WEAKDEF void DMA2_BTC4_IrqHandler(void)
{
}
__WEAKDEF void DMA2_BTC5_IrqHandler(void)
{
}
__WEAKDEF void DMA2_BTC6_IrqHandler(void)
{
}
__WEAKDEF void DMA2_BTC7_IrqHandler(void)
{
}
__WEAKDEF void DMA2_Error0_IrqHandler(void)
{
}
__WEAKDEF void DMA2_Error1_IrqHandler(void)
{
}
__WEAKDEF void DMA2_Error2_IrqHandler(void)
{
}
__WEAKDEF void DMA2_Error3_IrqHandler(void)
{
}
__WEAKDEF void DMA2_Error4_IrqHandler(void)
{
}
__WEAKDEF void DMA2_Error5_IrqHandler(void)
{
}
__WEAKDEF void DMA2_Error6_IrqHandler(void)
{
}
__WEAKDEF void DMA2_Error7_IrqHandler(void)
{
}
__WEAKDEF void EFM_ProgramEraseError_IrqHandler(void)
{
}
__WEAKDEF void EFM_ColError_IrqHandler(void)
{
}
__WEAKDEF void EFM_OpEnd_IrqHandler(void)
{
}
__WEAKDEF void QSPI_Error_IrqHandler(void)
{
}
__WEAKDEF void MAU_Sqrt_IrqHandler(void)
{
}
__WEAKDEF void DVP_FrameStart_IrqHandler(void)
{
}
__WEAKDEF void DVP_FrameEnd_IrqHandler(void)
{
}
__WEAKDEF void DVP_LineStart_IrqHandler(void)
{
}
__WEAKDEF void DVP_LineEnd_IrqHandler(void)
{
}
__WEAKDEF void DVP_SWSyncError_IrqHandler(void)
{
}
__WEAKDEF void DVP_FifoError_IrqHandler(void)
{
}
__WEAKDEF void FMAC1_IrqHandler(void)
{
}
__WEAKDEF void FMAC2_IrqHandler(void)
{
}
__WEAKDEF void FMAC3_IrqHandler(void)
{
}
__WEAKDEF void FMAC4_IrqHandler(void)
{
}
__WEAKDEF void DCU1_IrqHandler(void)
{
}
__WEAKDEF void DCU2_IrqHandler(void)
{
}
__WEAKDEF void DCU3_IrqHandler(void)
{
}
__WEAKDEF void DCU4_IrqHandler(void)
{
}
__WEAKDEF void DCU5_IrqHandler(void)
{
}
__WEAKDEF void DCU6_IrqHandler(void)
{
}
__WEAKDEF void DCU7_IrqHandler(void)
{
}
__WEAKDEF void DCU8_IrqHandler(void)
{
}
__WEAKDEF void TMR0_1_CmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR0_1_CmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR0_2_CmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR0_2_CmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR2_1_CmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR2_1_CmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR2_1_OvfA_IrqHandler(void)
{
}
__WEAKDEF void TMR2_1_OvfB_IrqHandler(void)
{
}
__WEAKDEF void TMR2_2_CmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR2_2_CmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR2_2_OvfA_IrqHandler(void)
{
}
__WEAKDEF void TMR2_2_OvfB_IrqHandler(void)
{
}
__WEAKDEF void TMR2_3_CmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR2_3_CmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR2_3_OvfA_IrqHandler(void)
{
}
__WEAKDEF void TMR2_3_OvfB_IrqHandler(void)
{
}
__WEAKDEF void TMR2_4_CmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR2_4_CmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR2_4_OvfA_IrqHandler(void)
{
}
__WEAKDEF void TMR2_4_OvfB_IrqHandler(void)
{
}
__WEAKDEF void RTC_TimeStamp0_IrqHandler(void)
{
}
__WEAKDEF void RTC_TimeStamp1_IrqHandler(void)
{
}
__WEAKDEF void RTC_Alarm_IrqHandler(void)
{
}
__WEAKDEF void RTC_Period_IrqHandler(void)
{
}
__WEAKDEF void CLK_XtalStop_IrqHandler(void)
{
}
__WEAKDEF void SWDT_IrqHandler(void)
{
}
__WEAKDEF void WDT_IrqHandler(void)
{
}
__WEAKDEF void PWC_WakeupTimer_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GCmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GCmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GCmpC_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GCmpD_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GCmpE_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GCmpF_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GOvf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GUdf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GDte_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_SCmpUpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_SCmpDownA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_SCmpUpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_SCmpDownB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GCmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GCmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GCmpC_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GCmpD_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GCmpE_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GCmpF_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GOvf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GUdf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GDte_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_SCmpUpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_SCmpDownA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_SCmpUpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_SCmpDownB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GCmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GCmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GCmpC_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GCmpD_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GCmpE_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GCmpF_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GOvf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GUdf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GDte_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_SCmpUpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_SCmpDownA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_SCmpUpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_SCmpDownB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_4_GCmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_4_GCmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_4_GCmpC_IrqHandler(void)
{
}
__WEAKDEF void TMR6_4_GCmpD_IrqHandler(void)
{
}
__WEAKDEF void TMR6_4_GCmpE_IrqHandler(void)
{
}
__WEAKDEF void TMR6_4_GCmpF_IrqHandler(void)
{
}
__WEAKDEF void TMR6_4_GOvf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_4_GUdf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_4_Gdte_IrqHandler(void)
{
}
__WEAKDEF void TMR6_4_SCmpUpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_4_SCmpDownA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_4_SCmpUpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_4_SCmpDownB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_5_GCmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_5_GCmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_5_GCmpC_IrqHandler(void)
{
}
__WEAKDEF void TMR6_5_GCmpD_IrqHandler(void)
{
}
__WEAKDEF void TMR6_5_GCmpE_IrqHandler(void)
{
}
__WEAKDEF void TMR6_5_GCmpF_IrqHandler(void)
{
}
__WEAKDEF void TMR6_5_GOvf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_5_GUdf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_5_Gdte_IrqHandler(void)
{
}
__WEAKDEF void TMR6_5_SCmpUpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_5_SCmpDownA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_5_SCmpUpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_5_SCmpDownB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_6_GCmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_6_GCmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_6_GCmpC_IrqHandler(void)
{
}
__WEAKDEF void TMR6_6_GCmpD_IrqHandler(void)
{
}
__WEAKDEF void TMR6_6_GCmpE_IrqHandler(void)
{
}
__WEAKDEF void TMR6_6_GCmpF_IrqHandler(void)
{
}
__WEAKDEF void TMR6_6_GOvf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_6_GUdf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_6_Gdte_IrqHandler(void)
{
}
__WEAKDEF void TMR6_6_SCmpUpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_6_SCmpDownA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_6_SCmpUpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_6_SCmpDownB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_7_GCmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_7_GCmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_7_GCmpC_IrqHandler(void)
{
}
__WEAKDEF void TMR6_7_GCmpD_IrqHandler(void)
{
}
__WEAKDEF void TMR6_7_GCmpE_IrqHandler(void)
{
}
__WEAKDEF void TMR6_7_GCmpF_IrqHandler(void)
{
}
__WEAKDEF void TMR6_7_GOvf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_7_GUdf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_7_Gdte_IrqHandler(void)
{
}
__WEAKDEF void TMR6_7_SCmpUpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_7_SCmpDownA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_7_SCmpUpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_7_SCmpDownB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_8_GCmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_8_GCmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_8_GCmpC_IrqHandler(void)
{
}
__WEAKDEF void TMR6_8_GCmpD_IrqHandler(void)
{
}
__WEAKDEF void TMR6_8_GCmpE_IrqHandler(void)
{
}
__WEAKDEF void TMR6_8_GCmpF_IrqHandler(void)
{
}
__WEAKDEF void TMR6_8_GOvf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_8_GUdf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_8_Gdte_IrqHandler(void)
{
}
__WEAKDEF void TMR6_8_SCmpUpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_8_SCmpDownA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_8_SCmpUpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_8_SCmpDownB_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_GCmpUH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_GCmpUL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_GCmpVH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_GCmpVL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_GCmpWH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_GCmpWL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_ReloadU_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_ReloadV_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_ReloadW_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_GCmpUH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_GCmpUL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_GCmpVH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_GCmpVL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_GCmpWH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_GCmpWL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_ReloadU_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_ReloadV_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_ReloadW_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_GCmpUH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_GCmpUL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_GCmpVH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_GCmpVL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_GCmpWH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_GCmpWL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_ReloadU_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_ReloadV_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_ReloadW_IrqHandler(void)
{
}
__WEAKDEF void TMRA_1_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_1_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_1_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_2_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_2_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_2_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_3_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_3_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_3_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_4_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_4_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_4_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_5_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_5_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_5_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_6_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_6_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_6_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_7_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_7_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_7_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_8_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_8_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_8_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_9_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_9_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_9_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_10_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_10_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_10_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_11_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_11_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_11_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_12_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_12_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_12_Cmp_IrqHandler(void)
{
}
__WEAKDEF void EMB_GR0_IrqHandler(void)
{
}
__WEAKDEF void EMB_GR1_IrqHandler(void)
{
}
__WEAKDEF void EMB_GR2_IrqHandler(void)
{
}
__WEAKDEF void EMB_GR3_IrqHandler(void)
{
}
__WEAKDEF void EMB_GR4_IrqHandler(void)
{
}
__WEAKDEF void EMB_GR5_IrqHandler(void)
{
}
__WEAKDEF void EMB_GR6_IrqHandler(void)
{
}
__WEAKDEF void USART1_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART1_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART1_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART1_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART1_RxTO_IrqHandler(void)
{
}
__WEAKDEF void USART2_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART2_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART2_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART2_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART2_RxTO_IrqHandler(void)
{
}
__WEAKDEF void USART3_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART3_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART3_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART3_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART4_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART4_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART4_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART4_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART5_LinBreakField_IrqHandler(void)
{
}
__WEAKDEF void USART5_LinWakeup_IrqHandler(void)
{
}
__WEAKDEF void USART5_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART5_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART5_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART5_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART6_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART6_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART6_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART6_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART6_RxTO_IrqHandler(void)
{
}
__WEAKDEF void USART7_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART7_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART7_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART7_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART7_RxTO_IrqHandler(void)
{
}
__WEAKDEF void USART8_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART8_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART8_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART8_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART9_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART9_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART9_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART9_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART10_LinBreakField_IrqHandler(void)
{
}
__WEAKDEF void USART10_LinWakeup_IrqHandler(void)
{
}
__WEAKDEF void USART10_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART10_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART10_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART10_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void SPI1_RxFull_IrqHandler(void)
{
}
__WEAKDEF void SPI1_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void SPI1_Error_IrqHandler(void)
{
}
__WEAKDEF void SPI1_Idle_IrqHandler(void)
{
}
__WEAKDEF void SPI2_RxFull_IrqHandler(void)
{
}
__WEAKDEF void SPI2_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void SPI2_Error_IrqHandler(void)
{
}
__WEAKDEF void SPI2_Idle_IrqHandler(void)
{
}
__WEAKDEF void SPI3_RxFull_IrqHandler(void)
{
}
__WEAKDEF void SPI3_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void SPI3_Error_IrqHandler(void)
{
}
__WEAKDEF void SPI3_Idle_IrqHandler(void)
{
}
__WEAKDEF void SPI4_RxFull_IrqHandler(void)
{
}
__WEAKDEF void SPI4_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void SPI4_Error_IrqHandler(void)
{
}
__WEAKDEF void SPI4_Idle_IrqHandler(void)
{
}
__WEAKDEF void SPI5_RxFull_IrqHandler(void)
{
}
__WEAKDEF void SPI5_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void SPI5_Error_IrqHandler(void)
{
}
__WEAKDEF void SPI5_Idle_IrqHandler(void)
{
}
__WEAKDEF void SPI6_RxFull_IrqHandler(void)
{
}
__WEAKDEF void SPI6_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void SPI6_Error_IrqHandler(void)
{
}
__WEAKDEF void SPI6_Idle_IrqHandler(void)
{
}
__WEAKDEF void CAN1_IrqHandler(void)
{
}
__WEAKDEF void CAN2_IrqHandler(void)
{
}
__WEAKDEF void I2S1_Tx_IrqHandler(void)
{
}
__WEAKDEF void I2S1_Rx_IrqHandler(void)
{
}
__WEAKDEF void I2S1_Error_IrqHandler(void)
{
}
__WEAKDEF void I2S2_Tx_IrqHandler(void)
{
}
__WEAKDEF void I2S2_Rx_IrqHandler(void)
{
}
__WEAKDEF void I2S2_Error_IrqHandler(void)
{
}
__WEAKDEF void I2S3_Tx_IrqHandler(void)
{
}
__WEAKDEF void I2S3_Rx_IrqHandler(void)
{
}
__WEAKDEF void I2S3_Error_IrqHandler(void)
{
}
__WEAKDEF void I2S4_Tx_IrqHandler(void)
{
}
__WEAKDEF void I2S4_Rx_IrqHandler(void)
{
}
__WEAKDEF void I2S4_Error_IrqHandler(void)
{
}
__WEAKDEF void USBFS_Global_IrqHandler(void)
{
}
__WEAKDEF void SDIOC1_Normal_IrqHandler(void)
{
}
__WEAKDEF void SDIOC1_Error_IrqHandler(void)
{
}
__WEAKDEF void SDIOC2_Normal_IrqHandler(void)
{
}
__WEAKDEF void SDIOC2_Error_IrqHandler(void)
{
}
__WEAKDEF void ETH_Global_IrqHandler(void)
{
}
__WEAKDEF void ETH_Wakeup_IrqHandler(void)
{
}
__WEAKDEF void I2C1_RxFull_IrqHandler(void)
{
}
__WEAKDEF void I2C1_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void I2C1_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void I2C1_EE_IrqHandler(void)
{
}
__WEAKDEF void I2C2_RxFull_IrqHandler(void)
{
}
__WEAKDEF void I2C2_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void I2C2_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void I2C2_EE_IrqHandler(void)
{
}
__WEAKDEF void I2C3_RxFull_IrqHandler(void)
{
}
__WEAKDEF void I2C3_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void I2C3_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void I2C3_EE_IrqHandler(void)
{
}
__WEAKDEF void I2C4_RxFull_IrqHandler(void)
{
}
__WEAKDEF void I2C4_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void I2C4_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void I2C4_EE_IrqHandler(void)
{
}
__WEAKDEF void I2C5_RxFull_IrqHandler(void)
{
}
__WEAKDEF void I2C5_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void I2C5_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void I2C5_EE_IrqHandler(void)
{
}
__WEAKDEF void I2C6_RxFull_IrqHandler(void)
{
}
__WEAKDEF void I2C6_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void I2C6_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void I2C6_EE_IrqHandler(void)
{
}

__WEAKDEF void PWC_LVD1_IrqHandler(void)
{
}
__WEAKDEF void PWC_LVD2_IrqHandler(void)
{
}
__WEAKDEF void FCM_Error_IrqHandler(void)
{
}
__WEAKDEF void FCM_End_IrqHandler(void)
{
}
__WEAKDEF void FCM_Ovf_IrqHandler(void)
{
}
__WEAKDEF void CTC_Udf_IrqHandler(void)
{
}
__WEAKDEF void CTC_Ovf_IrqHandler(void)
{
}
__WEAKDEF void ADC1_SeqA_IrqHandler(void)
{
}
__WEAKDEF void ADC1_SeqB_IrqHandler(void)
{
}
__WEAKDEF void ADC1_Cmp0_IrqHandler(void)
{
}
__WEAKDEF void ADC1_Cmp1_IrqHandler(void)
{
}
__WEAKDEF void ADC1_CmpComb_IrqHandler(void)
{
}
__WEAKDEF void ADC2_SeqA_IrqHandler(void)
{
}
__WEAKDEF void ADC2_SeqB_IrqHandler(void)
{
}
__WEAKDEF void ADC2_Cmp0_IrqHandler(void)
{
}
__WEAKDEF void ADC2_Cmp1_IrqHandler(void)
{
}
__WEAKDEF void ADC2_CmpComb_IrqHandler(void)
{
}
__WEAKDEF void ADC3_SeqA_IrqHandler(void)
{
}
__WEAKDEF void ADC3_SeqB_IrqHandler(void)
{
}
__WEAKDEF void ADC3_Cmp0_IrqHandler(void)
{
}
__WEAKDEF void ADC3_Cmp1_IrqHandler(void)
{
}
__WEAKDEF void ADC3_CmpComb_IrqHandler(void)
{
}
__WEAKDEF void NFC_IrqHandler(void)
{
}
/**
 * @}
 */

#endif /* LL_INTERRUPTS_SHARE_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
